def schema_assmeble(schemas_dict:dict):
    """
    整合schema
    :param schemas_dict: 领域词字典
    :return: 返回集成后的schema字典（减小显存占用）
    """
    schema_assemble_dict = {}
    for domain, domian_schemas in schemas_dict.items():
        tmp = set()
        for schema in domian_schemas.values():
            tmp.update(schema)
        schema_assemble_dict[domain] = {'assemble_schemas': list(tmp)}
    return schema_assemble_dict

sensitive_words = {'秘密', '此件不公开','不得擅自扩散','机密','保密','版权所有','复制','传播','外传'}

schemas_dict_education = {
    '人员域': {
        # 学生身份信息
        '学生-基本信息': ['姓名','姓名拼音','曾用名','民族','性别名称','港澳台侨','国家地区','手机号','电子信箱','微信号','QQ号','通讯地址','邮政编码'],
        '学生-身份信息': ['身份证件类型','身份证件号'],
        '体质健康信息': ['身高等级','体重等级','肺活量等级','仰卧起坐等级','跑步等级','视力等级','篮球等级','足球等级'],
        '家庭成员信息': ['工作单位','家庭电话','家庭住址','家庭邮政编码','家庭关系','家庭成员姓名','联系方式','家长出生日期'],
        '资助信息': ['资助类型','资助年份','资助金额','资助学年','银行卡号','开户行'],
        '家庭经济信息': ['劳动力人口数','年人均收入','是否困难户'],
        # zy
        '学生-网络密码及关联信息': ['系统登录账号','密码'],
        # 学生校内信息
        '学生入学信息':['入学专业','学科门类','学习方式','培养方式','学生类别','是否在职生','在职工号','入学年月','入学年级','现在专业','研究方向','学制','学位类型','学籍状态','是否休学','是否请假','预计毕业年份','预计毕业月份','实际毕业时间'],
        '学籍信息': ['学籍相关信息','学籍异动信息','毕业中学','生源地'],
        '学历学位信息': ['学历码','所学专业','入学年月','学习形式码学制','结束学业年月','毕肄业学校或单位','毕业证号','毕业证书印制号','获得学位码'],
        '档案信息': ['异动日期','异动文号','异动类别','异动原因描述','复学日期','原系所','原班级','原专业','离校状态','档案接受地址','档案去向地','档案邮寄地址','邮寄方式','运单号','原导师','档案邮寄时间'],
        '处分信息': ['违纪类型','违纪日期','处分类型','处分日期','处分原因','处分文号','处分解除日期','处分撤销日期','处分撤销原因','申诉日期','申委会审议日期','申委会审议结论','违纪类别','审委会审议结论'],
        # 教师身份信息
        '教师-基本信息': ['姓名','性别','证件号码','出生日期','民族','最高学历','最高学位层次','获得最高学历的院校或机构'],
        '资格信息': ['资格种类','任教学科','证书号码','认证机构名称','专业技术职务名称','专业技术职务级别','取得资格时间','评审类型','评审学科','是否现职称'],
        '教师-身份信息': ['学工号','学院','单位','专业','班级','导师工号','导师类别','导师类别代码','导师联系方式'],
        '工资待遇信息': ['年工资收入','基本工资','绩效工资','乡村教师生活补助','其他津贴补贴','五险一金'],
        # zy
        '教师-网络密码及关联信息': ['系统登录账号','密码'],
        # 干部身份信息
        '干部-基本信息': ['姓名','性别','证件号码','出生日期','民族','最高学历','最高学位层次','获得最高学历的院校或机构'],
    },
    '财务域': {
        # 学生财务相关
        '一卡通消费信息': ['操作时间','科目描述','钱包交易金额','钱包余额','操作员','工作站','终端名称'],
        '创新基金信息': ['基金级别','资助年限','资助金额','研究成果'],
        # 账务管理
        # zy
        '账务数据': ['类型编号','类型名称','凭证标记','限制科目','限制性质码'],
        '凭证数据': ['凭证编号','分录标记码','凭证标记','凭证摘要','科目编号','部门代码','项目编号','记帐方向码','金额','生成日期','冲暂','支票号','备注','制单','复核','出纳'],
        '经费来源': ['会计年度','入帐月份','凭证标志','凭证日期'],
        '往来账数据': ['金额','原因'],
        '暂存款': ['金额','原因'],
        '暂付款': ['金额','原因'],
        '税务信息': ['金额','税务类型','抬头'],
        '票据信息': ['票本序号','启始号','截止号','票类码','规格','用途','领用人','联系方法','领用部门号','入帐科目及项目','金额限制','领用日期','归还日期','已用截止号','实开金额','有效张数','作废张数','交回人号','验收人号','备注'],
    },
    '资产域': {
        # 实验室设施数据
        '实验室资源数据': ['实验室号','实验室名称','建立日期','建筑面积','使用面积','实验室位置','负责人教工号','管理级别码','实验室类别码','实验室电话','器材管理员教工号','实验室介绍'],
        '实验室仪器': ['仪器号','仪器名称','英文名称','学校单位层次码','产权及使用状况码','分类号码型号','出厂日期','生产国别码','经费科目码','购置日期','厂家','出厂号','单据号'],
        # zy
        '实验室运行': ['实验室号','年度','投入额支出额','年耗电量','年耗水量','维护费'],
    },
    '校园生活': {
        # 学生活动数据
        '社会实践相关信息': ['实践起止时间','实践结束时间','实践团名称','实践主题','实践地点','实践团等级','指导老师','志愿者服务总时长','志愿服务项目名称','志愿服务日期','志愿服务地点','志愿服务时长','志愿服务组织名称','企业导师','基地名称','实践成绩','实践起始时间','开始时间','结束时间','志愿服务总时长'],
        # 竞赛数据
        '竞赛报名信息': ['队伍名称','学生身份','竞赛指导教师姓名','竞赛指导教师工作证号','参赛作品名称','指导老师','团队成员人数','竞赛形式'],
    },
    '教学域': {
        # 教学数据
        '考试信息': ['考号','外国语成绩','政治理论成绩','业务课成绩','加试成绩','加试科目','初试总成绩','复试成绩','初试权重','复试权重','总成绩','开课学期','课程编号','课程名称','成绩','成绩标识','学分','总学时','考核方式','考试性质','任课教师'],
        '教学成果信息': ['教学成果编号','教学成果名称','奖励级别码','授奖等级码','获奖年度','完成人总数'],
        # zy
        '教学经费信息': ['项目名称','金额'],
        # 进修学习相关信息
        '国内进修': ['进修去向','进修生生源','CSC登记号','所属项目','来华日期','入校日期','预计离校日期','毕业日期','在校状况码'],
        '出国（境）进修': ['批件号','批准天数','出境日期','入境日期','执行情况','经费来源','邀请单位','访问国家/地区','出访成果','出访任务','护照号', '通行证号','签发日期','失效日期'],
    },
    '科研域': {
        # 科研数据
        # zy
        '私密论文信息': ['论文题目','年份','发表时间','检索号','检索类型','刊物名称','卷','期','页码','是否ESI高被引论文','是否通讯作者','中科院JCR分区','影响因子','他引次数','是否第一作者'],
        '私密科研成果信息': ['项目名称','项目负责人','项目编号','立项日期','开始日期','计划结项日期','结项日期','项目性质','项目分类','位次','项目完成情况','项目来源','著作名称','书号','类别','出版时间','出版单位','本人位次','是否主编','本人撰写字数（千字）','总字数（千字）','所有作者'],
        '科研经费信息': ['经费来源','经费金额'],
        '科研合同信息': ['合同编号','合同名称','项目编号','甲方','乙方','两方','合同类型码','合同签订日期','合同截止日期','合同金额','是否已归档','签订地点合同起始日期','合同终止日期','课题分类','免证营业税','日期认定号','认定日期'],
        '科研机构相关信息': ['单位号','审批机构','审批日期','成立日期','管理体制码','定编人数','实有人数','业务管理人员数','用房面积','固定资产','从事研究的学科领域码','机构类型码','组成类型码','研究方向','办公地址','电子信箱','负责人职工号','负责人电话','负责人姓名','机构简介','机构名称','联系电话','主管部门编'],
        '技术转让': ['合同编号','合同名称','成交金额','本年实际收入','单位号','学科领域码','签定日期','负责人职工号','受让方名称','受让方类型码','社会经济效益码','所属项目编号'],
        # 学术交流
        '学术交流会议': ['会议中文名称','会议英文名称','会议地点','会议起始日期','会议终止日期','学科领域码','会议等级码','会议举办形式码','会议中文名称','会议英文名称','会议地点','会议起始日期','会议终止日期','学科领域码','会议等级码','会议举办形式码'],
        '派出人员': ['派出人员编号','交流类型码','学科领域码','国别码','交流开始日期','交流结束日期'],
        '接受人员': ['接受人员姓名','性别码','国别码','交流类型码','学科领域码','交流开始日期','交流结束日期'],
        # 项目数据
        # zy
        '私密项目信息': ['项目名称','项目负责人','项目编号','立项日期','开始日期','计划结项日期','结项日期','项目性质','项目分类','位次','项目完成情况','项目来源'],
    }
}

schemas_dict_education_D = {
    '人员域': {
        '学生身份信息': list({
            # 基本信息
            '姓名','姓名拼音','曾用名','民族','性别名称','港澳台侨','国家地区','手机号','电子信箱','微信号','QQ号','通讯地址','邮政编码',
            # 身份信息
            '身份证件类型','身份证件号',
            # 体质健康信息
            '身高等级','体重等级','肺活量等级','仰卧起坐等级','跑步等级','视力等级','篮球等级','足球等级',
            # 家庭成员信息
            '工作单位','家庭电话','家庭住址','家庭邮政编码','家庭关系','家庭成员姓名','联系方式','家长出生日期',
            # 资助信息
            '资助类型','资助年份','资助金额','资助学年','银行卡号','开户行',
            # 家庭经济信息
            '劳动力人口数','年人均收入','是否困难户',
            # zy
            # 网络密码及关联信息
            '系统登录账号','密码',
            }),
        '学生校内信息': list({
            # 学生入学信息
            '入学专业','学科门类','学习方式','培养方式','学生类别','是否在职生','在职工号','入学年月','入学年级','现在专业','研究方向','学制','学位类型','学籍状态','是否休学','是否请假','预计毕业年份','预计毕业月份','实际毕业时间',
            # 学籍信息
            '学籍相关信息','学籍异动信息','毕业中学','生源地',
            # 学历学位信息
            '学历码','所学专业','入学年月','学习形式码学制','结束学业年月','毕肄业学校或单位','毕业证号','毕业证书印制号','获得学位码',
            # 档案信息 
            '异动日期','异动文号','异动类别','异动原因描述','复学日期','原系所','原班级','原专业','离校状态','档案接受地址','档案去向地','档案邮寄地址','邮寄方式','运单号','原导师','档案邮寄时间',
            # 处分信息
            '违纪类型','违纪日期','处分类型','处分日期','处分原因','处分文号','处分解除日期','处分撤销日期','处分撤销原因','申诉日期','申委会审议日期','申委会审议结论','违纪类别','审委会审议结论',
            }),
        '教师身份信息': list({
            # 基本信息
            '姓名','性别','证件号码','出生日期','民族','最高学历','最高学位层次','获得最高学历的院校或机构',
            # 资格信息
            '资格种类','任教学科','证书号码','认证机构名称','专业技术职务名称','专业技术职务级别','取得资格时间','评审类型','评审学科','是否现职称',
            # 身份信息
            '学工号','学院','单位','专业','班级','导师工号','导师类别','导师类别代码','导师联系方式',
            # 工资待遇信息
            '年工资收入','基本工资','绩效工资','乡村教师生活补助','其他津贴补贴','五险一金',
            # zy
            # 网络密码及关联信息 
            '系统登录账号','密码',
            }),
        '干部身份信息': list({
            # 基本信息
            '姓名','性别','证件号码','出生日期','民族','最高学历','最高学位层次','获得最高学历的院校或机构',
            }),
    },
    '财务域': {
        '学生财务相关': list({
            # 一卡通消费信息
            '操作时间','科目描述','钱包交易金额','钱包余额','操作员','工作站','终端名称',
            # 创新基金信息
            '基金级别','资助年限','资助金额','研究成果'
            }),
        '账务管理': list({
            # zy
            # 账务数据
            '类型编号','类型名称','凭证标记','限制科目','限制性质码',
            # 凭证数据
            '凭证编号','分录标记码','凭证标记','凭证摘要','科目编号','部门代码','项目编号','记帐方向码','金额','生成日期','冲暂','支票号','备注','制单','复核','出纳',
            # 经费来源
            '会计年度','入帐月份','凭证标志','凭证日期',
            # 往来账数据
            '金额','原因',
            # 暂存款
            '金额','原因',
            # 暂付款
            '金额','原因',
            # 税务信息
            '金额','税务类型','抬头',
            # 票据信息
            '票本序号','启始号','截止号','票类码','规格','用途','领用人','联系方法','领用部门号','入帐科目及项目','金额限制','领用日期','归还日期','已用截止号','实开金额','有效张数','作废张数','交回人号','验收人号','备注',
            }),
    },
    '资产域': {
        '实验室设施数据': list({
            # 实验室资源数据
            '实验室号','实验室名称','建立日期','建筑面积','使用面积','实验室位置','负责人教工号','管理级别码','实验室类别码','实验室电话','器材管理员教工号','实验室介绍',
            # 实验室仪器
            '仪器号','仪器名称','英文名称','学校单位层次码','产权及使用状况码','分类号码型号','出厂日期','生产国别码','经费科目码','购置日期','厂家','出厂号','单据号',
            # zy
            # 实验室运行
            '实验室号','年度','投入额支出额','年耗电量','年耗水量','维护费',
            }),
    },
    '校园生活': {
        '学生活动数据': list({
            # 社会实践相关信息
            '实践起止时间','实践结束时间','实践团名称','实践主题','实践地点','实践团等级','指导老师','志愿者服务总时长','志愿服务项目名称','志愿服务日期','志愿服务地点','志愿服务时长','志愿服务组织名称','企业导师','基地名称','实践成绩','实践起始时间','开始时间','结束时间','志愿服务总时长',
            }),
        '竞赛数据': list({
            # 竞赛报名信息
            '队伍名称','学生身份','竞赛指导教师姓名','竞赛指导教师工作证号','参赛作品名称','指导老师','团队成员人数','竞赛形式',
            }),
    },
    '教学域': {
        '考试信息': list({
            # 考试信息
            '考号','外国语成绩','政治理论成绩','业务课成绩','加试成绩','加试科目','初试总成绩','复试成绩','初试权重','复试权重','总成绩','开课学期','课程编号','课程名称','成绩','成绩标识','学分','总学时','考核方式','考试性质','任课教师',
            # 教学成果信息
            '教学成果编号','教学成果名称','奖励级别码','授奖等级码','获奖年度','完成人总数',
            # zy
            # 教学经费信息
            '项目名称','金额',
            }),
        '进修学习相关信息': list({
            # 国内进修
            '进修去向','进修生生源','CSC登记号','所属项目','来华日期','入校日期','预计离校日期','毕业日期','在校状况码',
            # 出国（境）进修
            '批件号','批准天数','出境日期','入境日期','执行情况','经费来源','邀请单位','访问国家/地区','出访成果','出访任务','护照号', '通行证号','签发日期','失效日期',
            }),
    },
    '科研域': {
        '科研数据': list({
            # zy
            # 私密论文信息
            '论文题目','年份','发表时间','检索号','检索类型','刊物名称','卷','期','页码','是否ESI高被引论文','是否通讯作者','中科院JCR分区','影响因子','他引次数','是否第一作者',
            # 私密科研成果信息
            '项目名称','项目负责人','项目编号','立项日期','开始日期','计划结项日期','结项日期','项目性质','项目分类','位次','项目完成情况','项目来源','著作名称','书号','类别','出版时间','出版单位','本人位次','是否主编','本人撰写字数（千字）','总字数（千字）','所有作者',
            # 科研经费信息
            '经费来源','经费金额',
            # 科研合同信息
            '合同编号','合同名称','项目编号','甲方','乙方','两方','合同类型码','合同签订日期','合同截止日期','合同金额','是否已归档','签订地点合同起始日期','合同终止日期','课题分类','免证营业税','日期认定号','认定日期',
            # 科研机构相关信息
            '单位号','审批机构','审批日期','成立日期','管理体制码','定编人数','实有人数','业务管理人员数','用房面积','固定资产','从事研究的学科领域码','机构类型码','组成类型码','研究方向','办公地址','电子信箱','负责人职工号','负责人电话','负责人姓名','机构简介','机构名称','联系电话','主管部门编',
            # 技术转让
            '合同编号','合同名称','成交金额','本年实际收入','单位号','学科领域码','签定日期','负责人职工号','受让方名称','受让方类型码','社会经济效益码','所属项目编号',
        }),
        '学术交流': list({
            # 学术交流会议
            '会议中文名称','会议英文名称','会议地点','会议起始日期','会议终止日期','学科领域码','会议等级码','会议举办形式码','会议中文名称','会议英文名称','会议地点','会议起始日期','会议终止日期','学科领域码','会议等级码','会议举办形式码',
            # 派出人员
            '派出人员编号','交流类型码','学科领域码','国别码','交流开始日期','交流结束日期'
            # 接受人员
            '接受人员姓名','性别码','国别码','交流类型码','学科领域码','交流开始日期','交流结束日期',
            }),
        '项目数据': list({
            # zy
            # 私密项目信息
            '项目名称','项目负责人','项目编号','立项日期','开始日期','计划结项日期','结项日期','项目性质','项目分类','位次','项目完成情况','项目来源',
            }),
    },
}